# BuiltInFailures.OpeningFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OpeningFailures Class
BuiltInFailures Class Members See Also
---
Failures about Opening.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class OpeningFailures
```

Visual Basic
---
```text
Public NotInheritable Class OpeningFailures
```

Visual C++
---
```text
public ref class OpeningFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..OpeningFailures
# See Also
BuiltInFailures..::..OpeningFailures Members
Autodesk.Revit.DB Namespace